# Move to ~/Brewfile in order to be able to use `brew bundle --global` command

tap "buo/cask-upgrade"

brew "bat"
brew "btop"
brew "coreutils"
brew "cspell"
brew "dnsmasq", restart_service: :changed
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gnupg"
brew "grep"
brew "httpie"
brew "jq"
brew "luv"
brew "mkcert"
brew "ollama"
brew "openssh"
brew "poppler"
brew "ripgrep"
brew "snzip"
brew "tlrc"
brew "tree"
brew "tree-sitter-cli"
brew "yazi"
brew "ykman"
brew "yq"
brew "zoxide"
tap "felixkratz/formulae"
brew "felixkratz/formulae/borders"

# AI
tap "sst/tap"
brew "sst/tap/opencode"

# Coding
brew "neovim"
brew "git"
brew "git-delta"
brew "gh"
brew "lazydocker"
brew "lazygit"
brew "ast-grep"

# Go
brew "go"
brew "golangci-lint"

# Python
brew "uv"

# JS/TS
brew "fnm"
brew "deno"
tap "oven-sh/bun"
brew "oven-sh/bun/bun"
tap "supabase/tap"
brew "supabase/tap/supabase"

# AWS
brew "aws-sam-cli"
brew "awscli"
brew "awscli-local"
tap "pulumi/tap"
brew "pulumi/tap/pulumi"
tap "sst/tap"
brew "sst/tap/sst"
tap "noovolari/brew"
brew "noovolari/brew/leapp-cli"

cask "1password-cli"
cask "adobe-acrobat-reader"
cask "appcleaner"
cask "arc"
cask "bambu-studio"
cask "boop"
cask "brave-browser"
cask "chatgpt"
cask "claude"
cask "dbeaver-community"
cask "font-caskaydia-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "ghostty"
cask "google-chrome"
cask "gpg-suite-no-mail"
# Graphically shows disk usage within a file system
cask "grandperspective"
cask "handbrake-app"
cask "imageoptim"
cask "keka"
cask "leapp"
cask "lulu"
cask "notion"
cask "obsidian"
cask "openscad"
cask "signal"
cask "steam"
cask "superwhisper"
cask "vlc"
cask "yubico-yubikey-manager"
